---
kind: other
id: Properties.T:Autodesk.Revit.DB.SolidOptions
source: html/f4983b5c-6a83-4274-6209-e83c9eb7670a.htm
---
# SolidOptions Properties

Optional extra key used to create face and edge histories for the Solid.
 If extraFaceAndEdgeHistoryKey is higher than -1, the Solid's face and edge histories will be created depending on the geometry generation of the Solid.